thanhduongvs/incubator-nuttx/boards/arm/imxrt/imxrt1052-thatico/src/imxrt_semc_drv.h
#ifndef __IMXRT_SEMC_DRV_H
#define __IMXRT_SEMC_DRV_H

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "imxrt_common_drv.h"

#ifndef NULL
#define NULL ((void *)0)
#endif

#if !defined(ARRAY_SIZE)
#define ARRAY_SIZE(x) (sizeof(x) / sizeof((x)[0]))
#endif

//#define getreg32(a)    (*(volatile uint32_t *)(a))
//#define putreg32(v,a)  (*(volatile uint32_t *)(a) = (v))

//#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

//#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

//#define READ_BIT(REG, BIT)    ((REG) & (BIT))

//#define CLEAR_REG(REG)        ((REG) = (0x0))

#define READ_REG(REG)         ((*(volatile uint32_t *)(REG)))
#define WRITE_REG(REG, VAL)   (*(volatile uint32_t *)(REG) = (VAL))
#define READ_BIT(REG, BIT)    (READ_REG(REG) & (BIT))
#define SET_BIT(REG, BIT)     WRITE_REG(REG, READ_REG(REG) | (BIT))
#define CLEAR_BIT(REG, BIT)   WRITE_REG(REG, READ_REG(REG) & (~(BIT)))

//base->IOCR &= ~SEMC_IOCR_MUX_A8_MASK;
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))

typedef int32_t status_t;

#define SEMC_BASE_ADDRS                 0x402f0000  /* 16KB SEMC */
#define SEMC_BASE_PTRS                  SEMC_BASE_ADDRS
#define IMXRT_SEMC_MCR_OFFSET           0x00    /**< Module Control Register, offset: 0x0 */
#define IMXRT_SEMC_IOCR_OFFSET          0x04    /**< IO Mux Control Register, offset: 0x4 */
#define IMXRT_SEMC_BMCR0_OFFSET         0x08    /**< Bus (AXI) Master Control Register 0, offset: 0x8 */
#define IMXRT_SEMC_BMCR1_OFFSET         0x0c    /**< Bus (AXI) Master Control Register 1, offset: 0xC */
#define IMXRT_SEMC_BR0_OFFSET           0x10    /**< Base Register 0 (For SDRAM CS0 device)..Base Register 8 (For NAND device), array offset: 0x10, array step: 0x4 */
#define IMXRT_SEMC_BR1_OFFSET           0x14
#define IMXRT_SEMC_BR2_OFFSET           0x18
#define IMXRT_SEMC_BR3_OFFSET           0x1c
#define IMXRT_SEMC_BR4_OFFSET           0x20
#define IMXRT_SEMC_BR5_OFFSET           0x24
#define IMXRT_SEMC_BR6_OFFSET           0x28
#define IMXRT_SEMC_BR7_OFFSET           0x2c
#define IMXRT_SEMC_BR8_OFFSET           0x30
#define IMXRT_SEMC_INTEN_OFFSET         0x38    /**< Interrupt Enable Register, offset: 0x38 */
#define IMXRT_SEMC_INTR_OFFSET          0x3c    /**< Interrupt Enable Register, offset: 0x3C */
#define IMXRT_SEMC_SDRAMCR0_OFFSET      0x38    /**< SDRAM control register 0, offset: 0x40 */
#define IMXRT_SEMC_SDRAMCR1_OFFSET      0x44    /**< SDRAM control register 1, offset: 0x44 */
#define IMXRT_SEMC_SDRAMCR2_OFFSET      0x48    /**< SDRAM control register 2, offset: 0x48 */
#define IMXRT_SEMC_SDRAMCR3_OFFSET      0x4c    /**< SDRAM control register 3, offset: 0x4C */
#define IMXRT_SEMC_NANDCR0_OFFSET       0x50    /**< NAND control register 0, offset: 0x50 */
#define IMXRT_SEMC_NANDCR1_OFFSET       0x54    /**< NAND control register 1, offset: 0x54 */
#define IMXRT_SEMC_NANDCR2_OFFSET       0x58    /**< NAND control register 2, offset: 0x58 */
#define IMXRT_SEMC_NANDCR3_OFFSET       0x5c    /**< NAND control register 3, offset: 0x5C */
#define IMXRT_SEMC_NORCR0_OFFSET        0x60    /**< NOR control register 0, offset: 0x60 */
#define IMXRT_SEMC_NORCR1_OFFSET        0x64    /**< NOR control register 1, offset: 0x64 */
#define IMXRT_SEMC_NORCR2_OFFSET        0x68    /**< NOR control register 2, offset: 0x68 */
#define IMXRT_SEMC_NORCR3_OFFSET        0x6c    /**< NOR control register 3, offset: 0x6C */
#define IMXRT_SEMC_SRAMCR0_OFFSET       0x70    /**< SRAM control register 0, offset: 0x70 */
#define IMXRT_SEMC_SRAMCR1_OFFSET       0x74    /**< SRAM control register 1, offset: 0x74 */
#define IMXRT_SEMC_SRAMCR2_OFFSET       0x78    /**< SRAM control register 2, offset: 0x78 */
#define IMXRT_SEMC_SRAMCR3_OFFSET       0x7c    /**< SRAM control register 3, offset: 0x7C */
#define IMXRT_SEMC_DBICR0_OFFSET        0x80    /**< DBI-B control register 0, offset: 0x80 */
#define IMXRT_SEMC_DBICR1_OFFSET        0x84    /**< DBI-B control register 1, offset: 0x84 */
#define IMXRT_SEMC_IPCR0_OFFSET         0x90    /**< IP Command control register 0, offset: 0x90 */
#define IMXRT_SEMC_IPCR1_OFFSET         0x94    /**< IP Command control register 1, offset: 0x94 */
#define IMXRT_SEMC_IPCR2_OFFSET         0x98    /**< IP Command control register 2, offset: 0x98 */
#define IMXRT_SEMC_IPCMD_OFFSET         0x9c    /**< IP Command register, offset: 0x9C */
#define IMXRT_SEMC_IPTXDAT_OFFSET       0xa0    /**< TX DATA register (for IP Command), offset: 0xA0 */
#define IMXRT_SEMC_IPRXDAT_OFFSET       0xb0    /**< RX DATA register (for IP Command), offset: 0xB0 */
#define IMXRT_SEMC_STS0_OFFSET          0xc0    /**< Status register 0, offset: 0xC0 */
#define IMXRT_SEMC_STS1_OFFSET          0xc4    /**< Status register 1, offset: 0xC4 */
#define IMXRT_SEMC_STS2_OFFSET          0xc8    /**< Status register 2, offset: 0xC8 */
#define IMXRT_SEMC_STS3_OFFSET          0xcc    /**< Status register 3, offset: 0xCC */
#define IMXRT_SEMC_STS4_OFFSET          0xd0    /**< Status register 4, offset: 0xD0 */
#define IMXRT_SEMC_STS5_OFFSET          0xd4    /**< Status register 5, offset: 0xD4 */
#define IMXRT_SEMC_STS6_OFFSET          0xd8    /**< Status register 6, offset: 0xD8 */
#define IMXRT_SEMC_STS7_OFFSET          0xdc    /**< Status register 7, offset: 0xDC */
#define IMXRT_SEMC_STS8_OFFSET          0xe0    /**< Status register 8, offset: 0xE0 */
#define IMXRT_SEMC_STS9_OFFSET          0xe4    /**< Status register 9, offset: 0xE4 */
#define IMXRT_SEMC_STS10_OFFSET         0xe8    /**< Status register 10, offset: 0xE8 */
#define IMXRT_SEMC_STS11_OFFSET         0xec    /**< Status register 11, offset: 0xEC */
#define IMXRT_SEMC_STS12_OFFSET         0xf0    /**< Status register 12, offset: 0xF0 */
#define IMXRT_SEMC_STS13_OFFSET         0xf4    /**< Status register 13, offset: 0xF4 */
#define IMXRT_SEMC_STS14_OFFSET         0xf8    /**< Status register 14, offset: 0xF8 */
#define IMXRT_SEMC_STS15_OFFSET         0xfc    /**< Status register 15, offset: 0xFC */

