thanhduongvs/incubator-nuttx/boards/arm/imxrt/imxrt1052-thatico/src/imxrt_semc_drv.h
#define IMXRT_SEMC_MCR          (SEMC_BASE_ADDRS + IMXRT_SEMC_MCR_OFFSET)
#define IMXRT_SEMC_IOCR         (SEMC_BASE_ADDRS + IMXRT_SEMC_IOCR_OFFSET)
#define IMXRT_SEMC_BMCR0        (SEMC_BASE_ADDRS + IMXRT_SEMC_BMCR0_OFFSET)
#define IMXRT_SEMC_BMCR1        (SEMC_BASE_ADDRS + IMXRT_SEMC_BMCR1_OFFSET)
#define IMXRT_SEMC_BR0          (SEMC_BASE_ADDRS + IMXRT_SEMC_BR0_OFFSET)
#define IMXRT_SEMC_BR1          (SEMC_BASE_ADDRS + IMXRT_SEMC_BR1_OFFSET)
#define IMXRT_SEMC_BR2          (SEMC_BASE_ADDRS + IMXRT_SEMC_BR2_OFFSET)
#define IMXRT_SEMC_BR3          (SEMC_BASE_ADDRS + IMXRT_SEMC_BR3_OFFSET)
#define IMXRT_SEMC_BR4          (SEMC_BASE_ADDRS + IMXRT_SEMC_BR4_OFFSET)
#define IMXRT_SEMC_BR5          (SEMC_BASE_ADDRS + IMXRT_SEMC_BR5_OFFSET)
#define IMXRT_SEMC_BR6          (SEMC_BASE_ADDRS + IMXRT_SEMC_BR6_OFFSET)
#define IMXRT_SEMC_BR7          (SEMC_BASE_ADDRS + IMXRT_SEMC_BR7_OFFSET)
#define IMXRT_SEMC_BR8          (SEMC_BASE_ADDRS + IMXRT_SEMC_BR8_OFFSET)
#define IMXRT_SEMC_INTEN        (SEMC_BASE_ADDRS + IMXRT_SEMC_INTEN_OFFSET)
#define IMXRT_SEMC_INTR         (SEMC_BASE_ADDRS + IMXRT_SEMC_INTR_OFFSET)
#define IMXRT_SEMC_SDRAMCR0     (SEMC_BASE_ADDRS + IMXRT_SEMC_SDRAMCR0_OFFSET)
#define IMXRT_SEMC_SDRAMCR1     (SEMC_BASE_ADDRS + IMXRT_SEMC_SDRAMCR1_OFFSET)
#define IMXRT_SEMC_SDRAMCR2     (SEMC_BASE_ADDRS + IMXRT_SEMC_SDRAMCR2_OFFSET)
#define IMXRT_SEMC_SDRAMCR3     (SEMC_BASE_ADDRS + IMXRT_SEMC_SDRAMCR3_OFFSET)
#define IMXRT_SEMC_NANDCR0      (SEMC_BASE_ADDRS + IMXRT_SEMC_NANDCR0_OFFSET)
#define IMXRT_SEMC_NANDCR1      (SEMC_BASE_ADDRS + IMXRT_SEMC_NANDCR1_OFFSET)
#define IMXRT_SEMC_NANDCR2      (SEMC_BASE_ADDRS + IMXRT_SEMC_NANDCR2_OFFSET)
#define IMXRT_SEMC_NANDCR3     (SEMC_BASE_ADDRS + IMXRT_SEMC_NANDCR3_OFFSET)
#define IMXRT_SEMC_NORCR0      (SEMC_BASE_ADDRS + IMXRT_SEMC_NORCR0_OFFSET)
#define IMXRT_SEMC_NORCR1      (SEMC_BASE_ADDRS + IMXRT_SEMC_NORCR1_OFFSET)
#define IMXRT_SEMC_NORCR2      (SEMC_BASE_ADDRS + IMXRT_SEMC_NORCR2_OFFSET)
#define IMXRT_SEMC_NORCR3      (SEMC_BASE_ADDRS + IMXRT_SEMC_NORCR3_OFFSET)
#define IMXRT_SEMC_SRAMCR0     (SEMC_BASE_ADDRS + IMXRT_SEMC_SRAMCR0_OFFSET)
#define IMXRT_SEMC_SRAMCR1     (SEMC_BASE_ADDRS + IMXRT_SEMC_SRAMCR1_OFFSET)
#define IMXRT_SEMC_SRAMCR2     (SEMC_BASE_ADDRS + IMXRT_SEMC_SRAMCR2_OFFSET)
#define IMXRT_SEMC_SRAMCR3     (SEMC_BASE_ADDRS + IMXRT_SEMC_SRAMCR3_OFFSET)
#define IMXRT_SEMC_DBICR0      (SEMC_BASE_ADDRS + IMXRT_SEMC_DBICR0_OFFSET)
#define IMXRT_SEMC_DBICR1      (SEMC_BASE_ADDRS + IMXRT_SEMC_DBICR1_OFFSET)
#define IMXRT_SEMC_IPCR0        (SEMC_BASE_ADDRS + IMXRT_SEMC_IPCR0_OFFSET)
#define IMXRT_SEMC_IPCR1        (SEMC_BASE_ADDRS + IMXRT_SEMC_IPCR1_OFFSET)
#define IMXRT_SEMC_IPCR2        (SEMC_BASE_ADDRS + IMXRT_SEMC_IPCR2_OFFSET)
#define IMXRT_SEMC_IPCMD        (SEMC_BASE_ADDRS + IMXRT_SEMC_IPCMD_OFFSET)
#define IMXRT_SEMC_IPTXDAT      (SEMC_BASE_ADDRS + IMXRT_SEMC_IPTXDAT_OFFSET)
#define IMXRT_SEMC_IPRXDAT      (SEMC_BASE_ADDRS + IMXRT_SEMC_IPRXDAT_OFFSET)
#define IMXRT_SEMC_STS0         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS0_OFFSET)
#define IMXRT_SEMC_STS1         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS1_OFFSET)
#define IMXRT_SEMC_STS2         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS2_OFFSET)
#define IMXRT_SEMC_STS3         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS3_OFFSET)
#define IMXRT_SEMC_STS4         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS4_OFFSET)
#define IMXRT_SEMC_STS5         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS5_OFFSET)
#define IMXRT_SEMC_STS6         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS6_OFFSET)
#define IMXRT_SEMC_STS7         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS7_OFFSET)
#define IMXRT_SEMC_STS8         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS8_OFFSET)
#define IMXRT_SEMC_STS9         (SEMC_BASE_ADDRS + IMXRT_SEMC_STS9_OFFSET)
#define IMXRT_SEMC_STS10        (SEMC_BASE_ADDRS + IMXRT_SEMC_STS10_OFFSET)
#define IMXRT_SEMC_STS11        (SEMC_BASE_ADDRS + IMXRT_SEMC_STS11_OFFSET)
#define IMXRT_SEMC_STS12        (SEMC_BASE_ADDRS + IMXRT_SEMC_STS12_OFFSET)
#define IMXRT_SEMC_STS13        (SEMC_BASE_ADDRS + IMXRT_SEMC_STS13_OFFSET)
#define IMXRT_SEMC_STS14        (SEMC_BASE_ADDRS + IMXRT_SEMC_STS14_OFFSET)
#define IMXRT_SEMC_STS15        (SEMC_BASE_ADDRS + IMXRT_SEMC_STS15_OFFSET)

/*! @brief Define macros for SEMC driver. */
#define SEMC_IPCOMMANDDATASIZEBYTEMAX (4U)
#define SEMC_IPCOMMANDMAGICKEY        (0xA55A)
#if defined(FSL_FEATURE_SEMC_SUPPORT_SRAM_COUNT) && (FSL_FEATURE_SEMC_SUPPORT_SRAM_COUNT > 0x01U)
#define SEMC_IOCR_PINMUXBITWIDTH (0x4UL)
#else
#define SEMC_IOCR_PINMUXBITWIDTH (0x3UL)
#endif /* FSL_FEATURE_SEMC_SUPPORT_SRAM_COUNT */
#define SEMC_IOCR_NAND_CE   (4UL)
#define SEMC_IOCR_NOR_CE    (5UL)
#define SEMC_IOCR_NOR_CE_A8 (2UL)
#define SEMC_IOCR_PSRAM_CE  (6UL)
#if defined(SEMC_IOCR_PINMUXBITWIDTH) && (SEMC_IOCR_PINMUXBITWIDTH == 0x4UL)
#define SEMC_IOCR_PSRAM_CE_A8 (6UL)
#else
#define SEMC_IOCR_PSRAM_CE_A8 (3UL)
#endif /* SEMC_IOCR_PINMUXBITWIDTH */
#define SEMC_IOCR_DBI_CSX                     (7UL)
#define SEMC_IOCR_DBI_CSX_A8                  (4UL)
#define SEMC_NORFLASH_SRAM_ADDR_PORTWIDTHBASE (24U)
#define SEMC_NORFLASH_SRAM_ADDR_PORTWIDTHMAX  (28U)
#define SEMC_BMCR0_TYPICAL_WQOS               (5U)
#define SEMC_BMCR0_TYPICAL_WAGE               (8U)
#define SEMC_BMCR0_TYPICAL_WSH                (0x40U)
#define SEMC_BMCR0_TYPICAL_WRWS               (0x10U)
#define SEMC_BMCR1_TYPICAL_WQOS               (5U)
#define SEMC_BMCR1_TYPICAL_WAGE               (8U)
#define SEMC_BMCR1_TYPICAL_WPH                (0x60U)
#define SEMC_BMCR1_TYPICAL_WBR                (0x40U)
#define SEMC_BMCR1_TYPICAL_WRWS               (0x24U)
#define SEMC_STARTADDRESS                     (0x80000000UL)
#define SEMC_ENDADDRESS                       (0xDFFFFFFFUL)
#define SEMC_BR_MEMSIZE_MIN                   (4U)
#define SEMC_BR_MEMSIZE_OFFSET                (2U)
#define SEMC_BR_MEMSIZE_MAX                   (4UL * 1024UL * 1024UL)
#define SEMC_SDRAM_MODESETCAL_OFFSET          (4U)
#define SEMC_BR_REG_NUM                       (9U)
#define SEMC_BYTE_NUMBIT                      (8U)

#define SEMC_IPCMD_KEY_MASK                      (0xFFFF0000U)
#define SEMC_IPCMD_KEY_SHIFT                     (16U)


